Repository: CofficLab/GitOK
Catalog: Plugins/GitNetworkSettingsPlugin/Sources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hk

# CA 文件会写入 `http.sslCAInfo`。关闭 SSL 验证只适合临时排障；企业网络应优先导入可信 CA 证书。
source: The CA file is written to `http.sslCAInfo`. Disabling SSL verification is only suitable for temporary troubleshooting; enterprise networks should prioritize importing trusted CA certificates.
zh_hans: CA 文件会写入 `http.sslCAInfo`。关闭 SSL 验证只适合临时排障；企业网络应优先导入可信 CA 证书。
zh_hk: CA 檔案會寫入 `http.sslCAInfo`。關閉 SSL 驗證只適合臨時排障；企業網路應優先匯入可信 CA 憑證。

source: Certificate
zh_hans: 证书
zh_hk: 憑證

# Certificate configuration description
source: The CA file is written to `http.sslCAInfo`. Disabling SSL verification is only suitable for temporary troubleshooting; enterprise networks should prioritize importing trusted CA certificates.
zh_hans: CA 文件会写入 `http.sslCAInfo`。关闭 SSL 验证只适合临时排障；企业网络应优先导入可信 CA 证书。
zh_hk: CA 檔案會寫入 `http.sslCAInfo`。關閉 SSL 驗證只適合臨時排障；企業網路應優先匯入可信 CA 憑證。

source: Choose
zh_hans: 选择
zh_hk: 選擇

source: Clear
zh_hans: 清除
zh_hk: 清除

source: Enable Git SSL certificate verification
zh_hans: 启用 Git SSL 证书验证
zh_hk: 啟用 Git SSL 憑證驗證

source: Git network configuration saved
zh_hans: Git 网络配置已保存
zh_hk: Git 網絡配置已儲存

# GitNetworkSettingsPlugin
source: Network
zh_hans: 网络
zh_hk: 網路

source: HTTP proxy
zh_hans: HTTP 代理
zh_hk: HTTP 代理

source: HTTPS proxy
zh_hans: HTTPS 代理
zh_hk: HTTPS 代理

source: Open Keychain Access
zh_hans: 打开钥匙串访问
zh_hk: 打開鑰匙圈存取

source: Proxy
zh_hans: 代理
zh_hk: 代理

# Proxy configuration description
source: Writes to Git global config `http.proxy` and `https.proxy`. If the proxy requires authentication, use the format `http://user:password@host:port`.
zh_hans: 会写入 Git 全局配置 `http.proxy` 和 `https.proxy`。如果代理需要认证，可使用 `http://user:password@host:port` 格式。
zh_hk: 會寫入 Git 全域設定 `http.proxy` 和 `https.proxy`。如果代理需要認證，可使用 `http://user:password@host:port` 格式。

source: Reading Git network config…
zh_hans: 正在读取 Git 网络配置…
zh_hk: 正在讀取 Git 網絡配置…

source: Save
zh_hans: 保存
zh_hk: 儲存

source: Writes to Git global config `http.proxy` and `https.proxy`. If the proxy requires authentication, use the format `http://user:password@host:port`.
zh_hans: 会写入 Git 全局配置 `http.proxy` 和 `https.proxy`。如果代理需要认证，可使用 `http://user:password@host:port` 格式。
zh_hk: 會寫入 Git 全域設定 `http.proxy` 和 `https.proxy`。如果代理需要認證，可使用 `http://user:password@host:port` 格式。

# 网络
source: Network
zh_hans: 网络
zh_hk: 網路
